---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.FilterDialog
source: html/502092c3-7c19-4c42-50ec-92a483157bbb.htm
---
# FilterDialog Members

Constructs a new instance of the FilterDialog class,
 while setting the id of the FilterElement to be selected when the dialog is shown.